       IDENTIFICATION DIVISION.
           PROGRAM-ID. HELLO-WORLD.

       PROCEDURE DIVISION.
           DISPLAY "OLA, MUNDO COBOL!".
           STOP RUN.